In [3]:
import pandas as pd
import numpy as np

In [4]:
df=pd.read_csv('Salary_Data.csv')
print(df)

       Age  Gender    Education Level              Job Title  \
0     32.0    Male         Bachelor's      Software Engineer
1     28.0  Female           Master's           Data Analyst
2     45.0    Male                PhD         Senior Manager
3     36.0  Female         Bachelor's        Sales Associate
4     52.0    Male           Master's               Director
...    ...     ...                ...                    ...
6699  49.0  Female                PhD  Director of Marketing
6700  32.0    Male        High School        Sales Associate
6701  30.0  Female  Bachelor's Degree      Financial Manager
6702  46.0    Male    Master's Degree      Marketing Manager
6703  26.0  Female        High School        Sales Executive

      Years of Experience    Salary
0                     5.0   90000.0
1                     3.0   65000.0
2                    15.0  150000.0
3                     7.0   60000.0
4                    20.0  200000.0
...                   ...       ...
6699                 20.0  200000.0
6700                  3.0   50000.0
6701                  4.0   55000.0
6702                 14.0  140000.0
6703                  1.0   35000.0

[6704 rows x 6 columns]

In [5]:
df.loc[:,'Age'].mean()

33.62085944494181

In [6]:
df.median(numeric_only=True)

Age                        32.0
Years of Experience         7.0
Salary                 115000.0
dtype: float64

In [7]:
df.loc[:,'Age'].median()

32.0

In [8]:
df.mode()

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,27.0,Male,Bachelor's Degree,Software Engineer,2.0,140000.0

In [9]:
df.loc[:,'Age'].mode()

0    27.0
Name: Age, dtype: float64

In [10]:
df.describe()

               Age  Years of Experience         Salary
count  6702.000000          6701.000000    6699.000000
mean     33.620859             8.094687  115326.964771
std       7.614633             6.059003   52786.183911
min      21.000000             0.000000     350.000000
25%      28.000000             3.000000   70000.000000
50%      32.000000             7.000000  115000.000000
75%      38.000000            12.000000  160000.000000
max      62.000000            34.000000  250000.000000

In [11]:
df.loc[:,'Age'].min(skipna = False)

nan

In [12]:
df.loc[:,'Age'].max(skipna = False)

nan

In [13]:
df.loc[:,'Age'].std()

7.614632626251171

In [14]:
df.groupby(['Age'])['Salary'].mean()

Age
21.0     25000.000000
22.0     32910.933333
23.0     47192.009615
24.0     51052.250000
25.0     63730.387324
26.0     65949.106870
27.0     77432.729207
28.0     84140.368298
29.0     85764.750000
30.0    100903.955457
31.0    114381.461538
32.0    120500.179487
33.0    127425.266332
34.0    132065.291262
35.0    119365.835000
36.0    134071.725979
37.0    146939.461538
38.0    138185.570470
39.0    147282.715190
40.0    149862.989130
41.0    155235.565891
42.0    155952.477273
43.0    165409.398734
44.0    160518.873016
45.0    170334.291667
46.0    171242.362745
47.0    178750.106383
48.0    192723.846939
49.0    189013.582418
50.0    190849.897727
51.0    200356.066667
52.0    187629.379310
53.0    180806.571429
54.0    189816.250000
55.0    198482.187500
56.0    196577.636364
57.0    176993.777778
58.0    195715.428571
60.0    186132.400000
61.0    200000.000000
62.0    200000.000000
Name: Salary, dtype: float64

In [33]:
df['Salary'] = df['Salary'].apply(str)
print(df.head())

    Age  Gender Education Level          Job Title  Years of Experience  \
0  32.0    Male      Bachelor's  Software Engineer                  5.0
1  28.0  Female        Master's       Data Analyst                  3.0
2  45.0    Male             PhD     Senior Manager                 15.0
3  36.0  Female      Bachelor's    Sales Associate                  7.0
4  52.0    Male        Master's           Director                 20.0

     Salary
0   90000.0
1   65000.0
2  150000.0
3   60000.0
4  200000.0

In [16]:
print(df.dtypes)

Age                    float64
Gender                  object
Education Level         object
Job Title               object
Years of Experience    float64
Salary                 float64
dtype: object

In [19]:
df.min(numeric_only=True)

Age                     21.0
Years of Experience      0.0
Salary                 350.0
dtype: float64

In [20]:
df.fillna(0, inplace=True)  # Replaces NaN with 0

In [22]:
print(df.min(numeric_only=True))

col1    1.0
col2    1.5
dtype: float64

In [25]:
df.mean(numeric_only=True)

col1    2.50
col2    3.26
dtype: float64

In [26]:
df.max()

col1    4.0
col2    5.0
col3      e
dtype: object